sample-templates/openfoam-10/windAroundBuildings/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory
source /opt/openfoam10/etc/bashrc

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatures

runApplication blockMesh
runApplication snappyHexMesh -overwrite

runApplication decomposePar

runParallel $(getApplication)

#runApplication $(getApplication)

runApplication reconstructParMesh -constant


#------------------------------------------------------------------------------
